// =============================================================================
// countdown.h アクションカウントダウンサンプル
// 制作日：2024/01/31 制作者：安田晴人
// =============================================================================
#ifndef _COUNTDOWN_H_
#define _COUNTDOWN_H_


//-----------------------------------------------
// 構造体宣言
//-----------------------------------------------
struct COUNTDOWN
{
	char map[20][80];		//画面
	int FrameCnt;			//フレームカウンター

	char CountSound[32];		//カウントダウン
	int CountSoundHandle;		//サウンドハンドル

	char StartSound[32];		//スタート音
	int StartSoundHandle;		//サウンドハンドル
};


//-----------------------------------------------
// プロトタイプ宣言
//-----------------------------------------------
void InitializeCountdown(void);		//カウントダウンシーン初期化
void UpdateCountdown(void);			//カウントダウンシーン更新
void DrawCountdown(void);				//カウントダウンシーン描画
void FinalizeCountdown(void);			//カウントダウンシーン終了



#endif