//-----------------------------------------------
// FIELD.h アクションゲームサンプル
// 制作日：2024/01/16 制作者：安田晴人
//-----------------------------------------------

#ifndef _FIELD_H_		//インクルードガード
#define _FIELD_H_

//-----------------------------------------------
// マクロ定義
//-----------------------------------------------
#define MIN_FIELD_X		(1)		//フィールドのX座標の最小値
#define MAX_FIELD_X		(80)		//フィールドのX座標の最大値
#define FIELD_POSY		(20)		//フィールドのY座標

//-----------------------------------------------
// 構造体宣言
//-----------------------------------------------
struct FIELD
{//フィールド構造体
	float PosX;		//X座標
	float PosY;		//Y座標
	float OldPosX;	//１フレーム前のX座標
	float OldPosY;	//１フレーム前のY座標
};

//-----------------------------------------------
// プロトタイプ宣言
//-----------------------------------------------
void InitializeField(void);		//フィールド初期化
void UpdateField(void);			//フィールド更新
void DrawField(void);				//フィールド描画
void FinalizeField(void);			//フィールド終了





#endif
