// =============================================================================
// load.h アクションゲームサンプル
// 制作日：2024/02/13 制作者：安田晴人
// =============================================================================
#ifndef _LOAD_H_
#define _LOAD_H_


//-----------------------------------------------
// マクロ定義
//-----------------------------------------------
#define MAX_LOAD_X		(80)		//ロード画面のX座標の最大値
#define MAX_LOAD_Y		(25)		//ロード画面のY座標の最大値
#define LOAD_SECOND		(10)		//ロードにかかるフレーム数
#define MAX_CHIRI		(7)			//画面に表示する唐辛子の最大数

//-----------------------------------------------
// 構造体宣言
//-----------------------------------------------
struct LOAD
{//ロード構造体

	char map[25][80];		//ロード画面
	int FrameCnt;			//フレームカウンター
	int interval;			//インターバル

};

//-----------------------------------------------
// プロトタイプ宣言
//-----------------------------------------------
void InitializeLoad(void);		//ロード初期化
void UpdateLoad(void);			//ロード更新
void DrawLoad(void);				//ロード描画
void FinalizeLoad(void);			//ロード終了



#endif