// =============================================================================
// main.h アクションゲームサンプル
// 日付：2024/01/31 制作者：安田晴人
// =============================================================================
#ifndef _MAIN_H_
#define _MAIN_H_

//-----------------------------------------------
// インクルード
//-----------------------------------------------
#include <time.h>

#define _USE_MATH_DEFINES
#include <math.h>

//-----------------------------------------------
// 列挙体宣言
//-----------------------------------------------
enum SCENE
{
	SCENE_TITLE = 0,
	SCENE_LOAD,
	SCENE_GAME,
	SCENE_RESULT,
	SCENE_RANKING,
	SCENE_EXPLANATION,
	SCENE_COUNTDOWN,
	SCENE_MAX,
};

//-----------------------------------------------
// プロトタイプ宣言
//-----------------------------------------------
void SetScene(SCENE s);
void FinishGame();

#endif
