//-----------------------------------------------
// FIELD.h アクションゲームサンプル
// 制作日：2024/01/16 制作者：安田晴人
//-----------------------------------------------

#ifndef _FIELD_H_		//インクルードガード
#define _FIELD_H_

//-----------------------------------------------
// マクロ定義
//-----------------------------------------------
#define INITIAL_FIELD_X		(1.0f)		//地面の初期X座標
#define INITIAL_FIELD_Y		(30.0f)		//地面の初期Y座標
#define FIELD_POSY			(30.0f)		//地面の初期Y座標

//-----------------------------------------------
// 構造体宣言
//-----------------------------------------------
struct FIELD
{//地面構造体
	float PosX;		//X座標
	float PosY;		//Y座標
	float OldPosX;	//１フレーム前のX座標
	float OldPosY;	//１フレーム前のY座標
};

//-----------------------------------------------
// プロトタイプ宣言
//-----------------------------------------------
void InitializeField(void);		//地面初期化
void UpdateField(void);			//地面更新
void DrawField(void);				//地面描画
void FinalizeField(void);			//地面終了





#endif
