//-----------------------------------------------
// Bullet.cpp
// 制作日：2025/01/06
// 制作者：安田晴人
//-----------------------------------------------
#include "Bullet.h"
#include "Sprite3D.h"
#include "Game.h"

//-----------------------------------------------
// 初期化処理
//-----------------------------------------------
void BULLET::Init(void)
{
	m_p_model = ModelLoad("asset\\model\\ball.fbx");
}

//-----------------------------------------------
// 終了処理
//-----------------------------------------------
void BULLET::Uninit(void)
{
	ModelRelease(m_p_model);
}

//-----------------------------------------------
// 更新処理
//-----------------------------------------------
void BULLET::Update(void)
{
	m_pos.x += m_vec.x;
	m_pos.y += m_vec.y;
	m_pos.z += m_vec.z;
}

//-----------------------------------------------
// 描画処理
//-----------------------------------------------
void BULLET::Draw(void)
{
	DrawSpriteModel(m_pos, m_rot, m_sca, m_color, m_p_model);
}