// =============================================================================
// game.h アクションゲームサンプル
// 制作日：2024/01/31 制作者：安田晴人
// =============================================================================
#ifndef _GAME_H_
#define _GAME_H_


//-----------------------------------------------
// プロトタイプ宣言
//-----------------------------------------------
void InitializeGame(void);		//ゲームシーン初期化
void UpdateGame(void);			//ゲームシーン更新
void DrawGame(void);				//ゲームシーン描画
void FinalizeGame(void);			//ゲームシーン終了



#endif