//-----------------------------------------------
// field.cpp アクションゲームサンプル
// 制作日：2024/01/16 制作者：安田晴人
//-----------------------------------------------
#include "main.h"
#include "field.h"

#define CONIOEX
#include "conioex.h"

//-----------------------------------------------
// グローバル変数
//------------------------------------------------
FIELD field;

//-----------------------------------------------
// 地面初期化
//-----------------------------------------------
void InitializeField(void) 
{
	field.PosX = INITIAL_FIELD_X;
	field.PosY = INITIAL_FIELD_Y;
	
	//地面実体の色設定
	textcolor(WHITE);

	//地面実体の描画位置設定
	gotoxy((int)field.PosX, (int)field.PosY);

	//画面表示
	printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■");


	//色をもとに戻す
	textcolor(WHITE);

}

//-----------------------------------------------
// 地面更新
//-----------------------------------------------
void UpdateField(void)
{
	
}

//-----------------------------------------------
// 地面描画
//-----------------------------------------------
void DrawField(void)
{

	
}

//-----------------------------------------------
// 地面終了
//-----------------------------------------------
void FinalizeField(void)
{
	//２年生になってテクスチャーとかモデルとかを読み込んだ時に解放するのに使う
	//今のところはあまり使わないが癖づけておく


}

