// =============================================================================
// result.h アクションゲームサンプル
// 制作日：2024/01/31 制作者：安田晴人
// =============================================================================
#ifndef _RESULT_H_
#define _RESULT_H_


//-----------------------------------------------
// プロトタイプ宣言
//-----------------------------------------------
void InitializeResult(void);		//リザルト初期化
void UpdateResult(void);			//リザルト更新
void DrawResult(void);				//リザルト描画
void FinalizeResult(void);			//リザルト終了



#endif