// =============================================================================
// title.h アクションゲームサンプル
// 制作日：2024/01/31 制作者：安田晴人
// =============================================================================
#ifndef _TITLE_H_
#define _TITLE_H_


//-----------------------------------------------
// プロトタイプ宣言
//-----------------------------------------------
void InitializeTitle(void);		//タイトル初期化
void UpdateTitle(void);			//タイトル更新
void DrawTitle(void);				//タイトル描画
void FinalizeTitle(void);			//タイトル終了



#endif