//-----------------------------------------------
// field.cpp アクションゲームサンプル
// 制作日：2024/01/16 制作者：安田晴人
//-----------------------------------------------
#include "main.h"
#include "field.h"
#include "bullet.h"

#define CONIOEX
#include "conioex.h"

//-----------------------------------------------
// グローバル変数
//------------------------------------------------
FIELD field;

//-----------------------------------------------
// フィールド初期化
//-----------------------------------------------
void InitializeField(void) 
{	
	//フィールド実体の色設定
	textcolor(WHITE);

	//フィールド実体の描画位置設定
	gotoxy(MIN_FIELD_X, FIELD_POSY);

	//画面表示
	printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■");
	
	//色をもとに戻す
	textcolor(WHITE);

}

//-----------------------------------------------
// フィールド更新
//-----------------------------------------------
void UpdateField(void)
{
	
}

//-----------------------------------------------
// フィールド描画
//-----------------------------------------------
void DrawField(void)
{
	
	
	

}

//-----------------------------------------------
// フィールド終了
//-----------------------------------------------
void FinalizeField(void)
{
	//２年生になってテクスチャーとかモデルとかを読み込んだ時に解放するのに使う
	//今のところはあまり使わないが癖づけておく


}

