// =============================================================================
// game.h アクションゲームサンプル
// 制作日：2024/01/31 制作者：安田晴人
// =============================================================================
#ifndef _GAME_H_
#define _GAME_H_


//-----------------------------------------------
// 構造体宣言
//-----------------------------------------------
struct GAME
{
	int Score;				//スコア
	int OldScore;			//1フレーム前のスコア

	char bgm[32];			//BGM
	int SoundHandle;		//サウンドハンドル

};


//-----------------------------------------------
// プロトタイプ宣言
//-----------------------------------------------
void InitializeGame(void);		//ゲームシーン初期化
void UpdateGame(void);			//ゲームシーン更新
void DrawGame(void);				//ゲームシーン描画
void FinalizeGame(void);			//ゲームシーン終了
void ScoreAdd(int score);	//スコア増加
int GetScore(void);					//スコアのゲッター


#endif