// =============================================================================
// ranking.h アクションゲームサンプル
// 制作日：2024/02/24 制作者：安田晴人
// =============================================================================
#ifndef _RANKING_H_
#define _RANKING_H_


//-----------------------------------------------
// マクロ定義
//-----------------------------------------------
#define MAX_RANKING_X		(80)		//ランキング画面のX座標の最大値
#define MAX_RANKING_Y		(25)		//ランキング画面のY座標の最大値


//-----------------------------------------------
// 構造体宣言
//-----------------------------------------------
struct RANKING
{//ランキング構造体

	char map[25][80];		//ランキング画面
	int FrameCnt;			//フレームカウンター

	char name[3][32];		//ランクインした名前
	int Score[3];			//ランクインしたスコア

	char bgm[32];			//BGM
	int SoundHandle;		//サウンドハンドル

	char enter[32];				//Enter
	int EnterSoundHandle;		//Enterサウンドハンドル
};

//-----------------------------------------------
// プロトタイプ宣言
//-----------------------------------------------
void InitializeRanking(void);		//ランキング初期化
void UpdateRanking(void);			//ランキング更新
void DrawRanking(void);				//ランキング描画
void FinalizeRanking(void);			//ランキング終了
void InputPlayerName(int num);				//名前入力


#endif