// =============================================================================
// result.h アクションゲームサンプル
// 制作日：2024/01/31 制作者：安田晴人
// =============================================================================
#ifndef _RESULT_H_
#define _RESULT_H_


//-----------------------------------------------
// 構造体宣言
//-----------------------------------------------
struct RESULT
{
	int Scovill;		//スコヴィル値（スコア）
	int FrameCnt;		//フレームカウンター
	char map[25][80];	//リザルト画面

	bool isPushD;		//タイトルの唐辛子を押してるかどうか

	char bgm[32];			//BGM
	int SoundHandle;		//サウンドハンドル

	char clap[32];				//拍手
	int ClapSoundHandle;		//サウンドハンドル
};


//-----------------------------------------------
// プロトタイプ宣言
//-----------------------------------------------
void InitializeResult(void);		//リザルト初期化
void UpdateResult(void);			//リザルト更新
void DrawResult(void);				//リザルト描画
void FinalizeResult(void);			//リザルト終了



#endif